"""
_check_obj_relationship 函数会使用此map

1 并列, 2从属(
其中 "name"为子，即函数中的self_obj;
"2" 的列表中为父, 即函数中的 other_obj
)

并列的示例:
样本9, 基底节 与 内外囊 没有关系
样本20, 纵隔 与 气管 并列

从属的示例
[39] 膀胱(父) + 输尿管(子)
[48] 小脑(父) + 脑干(子)
"""

obj_rel_map = [
    {
        "name": "脑沟",
        "rel": {
            "1": ["脑池"],
            "2": []
        }
    },
    {
        "name": "蝶窦",
        "rel": {
            "1": ["额窦", "筛窦"],
            "2": []
        }
    },
    {
        "name": "上颌窦",
        "rel": {
            "1": ["筛窦", "蝶窦"],
            "2": []
        }
    },
    {
        "name": "纵隔",
        "rel": {
            "1": ["气管"],
            "2": []
        }
    },
    # 气管, 支气管, 肺, 这3者一起组成了3呼吸道系统，所以气管和支气管是并列的，而不是从属
    {
        "name": "气管",
        "rel": {
            "1": ["纵隔", "支气管"],
            "2": []
        }
    },
    {
        "name": "血",
        "rel": {
            "1": [],
            "2": ["软组织"]
        }
    },
    {
        "name": "输尿管",
        "rel": {
            "1": [],
            "2": ["膀胱"]
        }
    },
    {
        "name": "小脑",
        "rel": {
            "1": [],
            "2": ["脑干"]
        }
    },
    {
        "name": "脑池",
        "rel": {
            "1": ["脑室"],
            "2": []
        }
    },
    # 室间隔有左室间隔，右室间隔，房室间隔等
    {
        "name": "左室",
        "rel": {
            "1": [],
            "2": ["室间隔"]
        }
    },
    # 样本63, 股骨和腓胫骨为并列
    {
        "name": "胫腓骨",
        "rel": {
            "1": ["股骨"],
            "2": []
        }
    },
    {
        "name": "肾盂",
        "rel": {
            "1": ["输尿管"],
            "2": []
        }
    },
    {
        "name": "肾小盏",
        "rel": {
            "1": ["肾盏"],
            "2": []
        }
    },
    {
        "name": "额",
        "rel": {
            "1": ["颞", "顶枕叶", "脑沟内"],
            "2": []
        }
    },
    # 54样本原文: "腹腔及腹膜后未见明显肿大淋巴结；"
    {
        "name": "腹膜后",
        "rel": {
            "1": ["腹腔"],
            "2": []
        }
    },
    # 55样本 "升结肠" 和 "回盲" 并列.
    # 原文本: "右侧升结肠及回盲部肠壁无明显增厚，"
    {
        "name": "回盲",
        "rel": {
            "1": ["升结肠"],
            "2": []
        }
    },
    # 82样本, "腰大肌" 与 "腹脂线" 并列
    {
        "name": "腹脂线",
        "rel": {
            "1": ["腰大肌"],
            "2": []
        }
    }
]
