"""
1 并列, 2从属

并列的示例:
样本9, 基底节 与 内外囊 没有关系
样本20, 纵隔 与 气管 并列

从属的示例
[29] 气管(父) + 支气管(子)
[39] 膀胱(父) + 输尿管(子)
[48] 小脑(父) + 脑干(子)
"""

obj_rel_map = [
    {
        "name": "脑沟",
        "rel": {
            "1": ["脑池"],
            "2": []
        }
    },
    {
        "name": "蝶窦",
        "rel": {
            "1": ["额窦", "筛窦", "蝶窦"],
            "2": []
        }
    },
    {
        "name": "纵隔",
        "rel": {
            "1": ["气管"],
            "2": []
        }
    },
    {
        "name": "气管",
        "rel": {
            "1": ["纵隔"],
            "2": ["支气管"]
        }
    },
    {
        "name": "血",
        "rel": {
            "1": [],
            "2": ["软组织"]
        }
    },
    {
        "name": "膀胱",
        "rel": {
            "1": [],
            "2": ["输尿管"]
        }
    },
{
        "name": "小脑",
        "rel": {
            "1": [],
            "2": ["脑干"]
        }
    },
    {
        "name": "脑池",
        "rel": {
            "1": ["脑室"],
            "2": []
        }
    },
{
        "name": "室间隔",
        "rel": {
            "1": [],
            "2": ["左室"]
        }
    },
]
